// Задача 50: 
// Напишите программу, которая на вход принимает позиции элемента в двумерном массиве, 
// и возвращает значение этого элемента или же указание, что такого элемента нет.

// Например, задан массив:
// 1 4 7 2
// 5 9 2 3
// 8 4 2 4

// 17 -> такого числа в массиве нет

int ReadNumber(string messageToUser)
{
    Console.WriteLine(messageToUser);
    int value = Convert.ToInt32(Console.ReadLine());
    return value;
}

int[,] GetRandomMatrix(int rows, int columns, int leftBorder = 1, int rightBorder = 9)
{

    int[,] matrix = new int[rows, columns];

    for(int i = 0; i < matrix.GetLength(0); i++)
    {
        for(int j = 0; j < matrix.GetLength(1); j++)
        {
            matrix[i, j] = Random.Shared.Next(leftBorder, rightBorder + 1);
        }
    }

    return matrix;
}

void PrintMatrix(int[,] matrix)
{
    for(int i = 0; i < matrix.GetLength(0); i++)
    {
        for(int j = 0; j < matrix.GetLength(1); j++)
        {
            Console.Write(matrix[i, j] + " ");
        }
        Console.WriteLine();
    }
}


int rowsMatrix = 4;
int columnsMatrix = 5;

int m = ReadNumber("Введите индекс элемента для строки:");
int n = ReadNumber("Введите индекс элемента для стобца:");
Console.WriteLine();
int[,] myMatrix = GetRandomMatrix(rowsMatrix, columnsMatrix);
PrintMatrix(myMatrix);
Console.WriteLine();
if(m <= rowsMatrix && n <= columnsMatrix)
{
    Console.WriteLine(myMatrix[m, n]);
}
else
{
    Console.WriteLine("error");
}
